yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151k4.h
#define MASK_TIM1_CCMR4_CC4S     0x03
#define MASK_TIM1_CCMR4_OC4PE    0x08
#define MASK_TIM1_CCMR4_OC4M     0x70
#define MASK_TIM1_CCMR4_OC4CE    0x80

#define MASK_TIM1_CCER1_CC1E     0x01
#define MASK_TIM1_CCER1_CC1P     0x02
#define MASK_TIM1_CCER1_CC1NE    0x04
#define MASK_TIM1_CCER1_CC1NP    0x08
#define MASK_TIM1_CCER1_CC2E     0x10
#define MASK_TIM1_CCER1_CC2P     0x20
#define MASK_TIM1_CCER1_CC2NE    0x40
#define MASK_TIM1_CCER1_CC2NP    0x80

#define MASK_TIM1_CCER2_CC3E     0x01
#define MASK_TIM1_CCER2_CC3P     0x02
#define MASK_TIM1_CCER2_CC3NE    0x04
#define MASK_TIM1_CCER2_CC3NP    0x08
#define MASK_TIM1_CCER2_CC4E     0x10
#define MASK_TIM1_CCER2_CC4P     0x20

#define MASK_TIM1_CNTRH_CNT8     0x01
#define MASK_TIM1_CNTRH_CNT9     0x02
#define MASK_TIM1_CNTRH_CNT10    0x04
#define MASK_TIM1_CNTRH_CNT11    0x08
#define MASK_TIM1_CNTRH_CNT12    0x10
#define MASK_TIM1_CNTRH_CNT13    0x20
#define MASK_TIM1_CNTRH_CNT14    0x40
#define MASK_TIM1_CNTRH_CNT15    0x80

#define MASK_TIM1_CNTRL_CNT0     0x01
#define MASK_TIM1_CNTRL_CNT1     0x02
#define MASK_TIM1_CNTRL_CNT2     0x04
#define MASK_TIM1_CNTRL_CNT3     0x08
#define MASK_TIM1_CNTRL_CNT4     0x10
#define MASK_TIM1_CNTRL_CNT5     0x20
#define MASK_TIM1_CNTRL_CNT6     0x40
#define MASK_TIM1_CNTRL_CNT7     0x80

#define MASK_TIM1_PSCRH_PSC8     0x01
#define MASK_TIM1_PSCRH_PSC9     0x02
#define MASK_TIM1_PSCRH_PSC10    0x04
#define MASK_TIM1_PSCRH_PSC11    0x08
#define MASK_TIM1_PSCRH_PSC12    0x10
#define MASK_TIM1_PSCRH_PSC13    0x20
#define MASK_TIM1_PSCRH_PSC14    0x40
#define MASK_TIM1_PSCRH_PSC15    0x80

#define MASK_TIM1_PSCRL_PSC0     0x01
#define MASK_TIM1_PSCRL_PSC1     0x02
#define MASK_TIM1_PSCRL_PSC2     0x04
#define MASK_TIM1_PSCRL_PSC3     0x08
#define MASK_TIM1_PSCRL_PSC4     0x10
#define MASK_TIM1_PSCRL_PSC5     0x20
#define MASK_TIM1_PSCRL_PSC6     0x40
#define MASK_TIM1_PSCRL_PSC7     0x80

#define MASK_TIM1_ARRH_ARR8      0x01
#define MASK_TIM1_ARRH_ARR9      0x02
#define MASK_TIM1_ARRH_ARR10     0x04
#define MASK_TIM1_ARRH_ARR11     0x08
#define MASK_TIM1_ARRH_ARR12     0x10
#define MASK_TIM1_ARRH_ARR13     0x20
#define MASK_TIM1_ARRH_ARR14     0x40
#define MASK_TIM1_ARRH_ARR15     0x80

#define MASK_TIM1_ARRL_ARR0      0x01
#define MASK_TIM1_ARRL_ARR1      0x02
#define MASK_TIM1_ARRL_ARR2      0x04
#define MASK_TIM1_ARRL_ARR3      0x08
#define MASK_TIM1_ARRL_ARR4      0x10
#define MASK_TIM1_ARRL_ARR5      0x20
#define MASK_TIM1_ARRL_ARR6      0x40
#define MASK_TIM1_ARRL_ARR7      0x80

#define MASK_TIM1_CCR1H_CCR18    0x01
#define MASK_TIM1_CCR1H_CCR19    0x02
#define MASK_TIM1_CCR1H_CCR110   0x04
#define MASK_TIM1_CCR1H_CCR111   0x08
#define MASK_TIM1_CCR1H_CCR112   0x10
#define MASK_TIM1_CCR1H_CCR113   0x20
#define MASK_TIM1_CCR1H_CCR114   0x40
#define MASK_TIM1_CCR1H_CCR115   0x80

#define MASK_TIM1_CCR1L_CCR10    0x01
#define MASK_TIM1_CCR1L_CCR11    0x02
#define MASK_TIM1_CCR1L_CCR12    0x04
#define MASK_TIM1_CCR1L_CCR13    0x08
#define MASK_TIM1_CCR1L_CCR14    0x10
#define MASK_TIM1_CCR1L_CCR15    0x20
#define MASK_TIM1_CCR1L_CCR16    0x40
#define MASK_TIM1_CCR1L_CCR17    0x80

#define MASK_TIM1_CCR2H_CCR28    0x01
#define MASK_TIM1_CCR2H_CCR29    0x02
#define MASK_TIM1_CCR2H_CCR210   0x04
#define MASK_TIM1_CCR2H_CCR211   0x08
#define MASK_TIM1_CCR2H_CCR212   0x10
#define MASK_TIM1_CCR2H_CCR213   0x20
#define MASK_TIM1_CCR2H_CCR214   0x40
#define MASK_TIM1_CCR2H_CCR215   0x80

#define MASK_TIM1_CCR2L_CCR20    0x01
#define MASK_TIM1_CCR2L_CCR21    0x02
#define MASK_TIM1_CCR2L_CCR22    0x04
#define MASK_TIM1_CCR2L_CCR23    0x08
#define MASK_TIM1_CCR2L_CCR24    0x10
#define MASK_TIM1_CCR2L_CCR25    0x20
#define MASK_TIM1_CCR2L_CCR26    0x40
#define MASK_TIM1_CCR2L_CCR27    0x80

#define MASK_TIM1_CCR3H_CCR38    0x01
#define MASK_TIM1_CCR3H_CCR39    0x02
#define MASK_TIM1_CCR3H_CCR310   0x04
#define MASK_TIM1_CCR3H_CCR311   0x08
#define MASK_TIM1_CCR3H_CCR312   0x10
#define MASK_TIM1_CCR3H_CCR313   0x20
#define MASK_TIM1_CCR3H_CCR314   0x40
#define MASK_TIM1_CCR3H_CCR315   0x80

#define MASK_TIM1_CCR3L_CCR30    0x01
#define MASK_TIM1_CCR3L_CCR31    0x02
#define MASK_TIM1_CCR3L_CCR32    0x04
#define MASK_TIM1_CCR3L_CCR33    0x08
#define MASK_TIM1_CCR3L_CCR34    0x10
#define MASK_TIM1_CCR3L_CCR35    0x20
#define MASK_TIM1_CCR3L_CCR36    0x40
#define MASK_TIM1_CCR3L_CCR37    0x80

#define MASK_TIM1_CCR4H_CCR48    0x01
#define MASK_TIM1_CCR4H_CCR49    0x02
#define MASK_TIM1_CCR4H_CCR410   0x04
#define MASK_TIM1_CCR4H_CCR411   0x08
#define MASK_TIM1_CCR4H_CCR412   0x10
#define MASK_TIM1_CCR4H_CCR413   0x20
#define MASK_TIM1_CCR4H_CCR414   0x40
#define MASK_TIM1_CCR4H_CCR415   0x80

#define MASK_TIM1_CCR4L_CCR40    0x01
#define MASK_TIM1_CCR4L_CCR41    0x02
#define MASK_TIM1_CCR4L_CCR42    0x04
#define MASK_TIM1_CCR4L_CCR43    0x08
#define MASK_TIM1_CCR4L_CCR44    0x10
#define MASK_TIM1_CCR4L_CCR45    0x20
#define MASK_TIM1_CCR4L_CCR46    0x40
#define MASK_TIM1_CCR4L_CCR47    0x80

#define MASK_TIM1_BKR_LOCK       0x03
#define MASK_TIM1_BKR_OSSI       0x04
#define MASK_TIM1_BKR_OSSR       0x08
#define MASK_TIM1_BKR_BKE        0x10
#define MASK_TIM1_BKR_BKP        0x20
#define MASK_TIM1_BKR_AOE        0x40
#define MASK_TIM1_BKR_MOE        0x80

#define MASK_TIM1_OISR_OIS1      0x01
#define MASK_TIM1_OISR_OIS1N     0x02
#define MASK_TIM1_OISR_OIS2      0x04
#define MASK_TIM1_OISR_OIS2N     0x08
#define MASK_TIM1_OISR_OIS3      0x10
#define MASK_TIM1_OISR_OIS3N     0x20

#define MASK_TIM1_DCR1_DBA       0x1F

#define MASK_TIM1_DCR2_DBL       0x1F


/*-------------------------------------------------------------------------
 *      TIM4 register definitions
 *-----------------------------------------------------------------------*/
/* TIM4 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char             : 3;
  unsigned char ARPE        : 1;
} __BITS_TIM4_CR1;
#endif
__IO_REG8_BIT(TIM4_CR1,    0x52E0, __READ_WRITE, __BITS_TIM4_CR1);

/* TIM4 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char MMS         : 3;
} __BITS_TIM4_CR2;
#endif
__IO_REG8_BIT(TIM4_CR2,    0x52E1, __READ_WRITE, __BITS_TIM4_CR2);

/* TIM4 Slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM4_SMCR;
#endif
__IO_REG8_BIT(TIM4_SMCR,   0x52E2, __READ_WRITE, __BITS_TIM4_SMCR);

/* TIM4 DMA1 request enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UDE         : 1;
} __BITS_TIM4_DER;
#endif
__IO_REG8_BIT(TIM4_DER,    0x52E3, __READ_WRITE, __BITS_TIM4_DER);

/* TIM4 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char             : 5;
  unsigned char TIE         : 1;
} __BITS_TIM4_IER;
#endif
__IO_REG8_BIT(TIM4_IER,    0x52E4, __READ_WRITE, __BITS_TIM4_IER);

/* TIM4 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char             : 5;
  unsigned char TIF         : 1;
} __BITS_TIM4_SR1;
#endif
__IO_REG8_BIT(TIM4_SR1,    0x52E5, __READ_WRITE, __BITS_TIM4_SR1);

/* TIM4 Event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char             : 5;
  unsigned char TG          : 1;
} __BITS_TIM4_EGR;
#endif
__IO_REG8_BIT(TIM4_EGR,    0x52E6, __WRITE, __BITS_TIM4_EGR);

